CREATE DATABASE  IF NOT EXISTS `dvdshop` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `dvdshop`;
-- MySQL dump 10.13  Distrib 8.0.43, for Win64 (x86_64)
--
-- Host: localhost    Database: dvdshop
-- ------------------------------------------------------
-- Server version	8.0.43

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `porder`
--

DROP TABLE IF EXISTS `porder`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `porder` (
  `id` int NOT NULL AUTO_INCREMENT,
  `memberid` int DEFAULT NULL,
  `username` varchar(45) DEFAULT NULL,
  `productname` varchar(45) DEFAULT NULL,
  `quantity` int DEFAULT NULL,
  `amount` int DEFAULT NULL,
  `porderdate` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `fk_porder_member_idx` (`memberid`),
  CONSTRAINT `fk_porder_member` FOREIGN KEY (`memberid`) REFERENCES `member` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=95 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `porder`
--

LOCK TABLES `porder` WRITE;
/*!40000 ALTER TABLE `porder` DISABLE KEYS */;
INSERT INTO `porder` VALUES (6,5,'chi123','哈利波特：神秘的魔法石',1,199,'2025-08-19 15:36:29'),(9,6,'kan123','哈利波特：神秘的魔法石',2,398,'2025-08-19 15:37:40'),(12,6,'kan123','哈利波特：神秘的魔法石',4,796,'2025-08-21 09:19:30'),(15,5,'chi123','哈利波特：神秘的魔法石',2,398,'2025-08-21 09:43:48'),(16,8,'Aaron111','哈利波特：阿茲卡班的逃犯',2,598,'2025-08-21 11:12:24'),(17,8,'Aaron111','哈利波特：消失的密室',3,597,'2025-08-21 11:12:24'),(18,8,'Aaron111','哈利波特：神秘的魔法石',3,597,'2025-08-21 11:12:24'),(19,9,'abel123','哈利波特：神秘的魔法石',1,199,'2025-08-21 11:17:10'),(20,9,'abel123','哈利波特：消失的密室',2,398,'2025-08-21 11:17:10'),(21,9,'abel123','哈利波特：阿茲卡班的逃犯',3,897,'2025-08-21 11:17:10'),(22,10,'ace123','哈利波特：消失的密室',2,398,'2025-08-21 11:30:03'),(23,10,'ace123','哈利波特：神秘的魔法石',1,199,'2025-08-21 11:30:03'),(24,10,'ace123','哈利波特：阿茲卡班的逃犯',3,897,'2025-08-21 11:30:03'),(25,11,'bard123','哈利波特：神秘的魔法石',1,199,'2025-08-21 11:38:55'),(26,11,'bard123','哈利波特：阿茲卡班的逃犯',3,897,'2025-08-21 11:38:55'),(27,11,'bard123','哈利波特：消失的密室',2,398,'2025-08-21 11:38:55'),(28,12,'baron123','哈利波特：阿茲卡班的逃犯',1,299,'2025-08-21 11:42:14'),(29,12,'baron123','哈利波特：神秘的魔法石',3,597,'2025-08-21 11:42:14'),(30,12,'baron123','哈利波特：消失的密室',2,398,'2025-08-21 11:42:14'),(31,9,'abel123','哈利波特：神秘的魔法石',1,199,'2025-08-21 14:35:42'),(32,9,'abel123','哈利波特：火盃的考驗',3,897,'2025-08-21 14:35:42'),(33,9,'abel123','哈利波特：消失的密室',2,398,'2025-08-21 14:35:42'),(34,9,'abel123','哈利波特：阿茲卡班的逃犯',4,1196,'2025-08-21 14:35:42'),(35,14,'cade123','哈利波特：鳳凰會的密令',2,598,'2025-08-22 10:12:55'),(36,14,'cade123','哈利波特：阿茲卡班的逃犯',2,598,'2025-08-22 10:12:55'),(37,14,'cade123','哈利波特：火盃的考驗',2,598,'2025-08-22 10:12:55'),(38,14,'cade123','哈利波特：消失的密室',3,597,'2025-08-22 10:12:55'),(39,15,'carr123','哈利波特：神秘的魔法石',1,199,'2025-08-22 14:17:16'),(40,15,'carr123','哈利波特：鳳凰會的密令',1,299,'2025-08-22 14:17:16'),(41,15,'carr123','哈利波特：阿茲卡班的逃犯',1,299,'2025-08-22 14:17:16'),(42,15,'carr123','哈利波特：火盃的考驗',3,897,'2025-08-22 14:17:16'),(43,15,'carr123','哈利波特：混血王子的背叛',2,798,'2025-08-22 14:17:16'),(44,16,'chance123','哈利波特：死神的聖物Ⅰ',1,499,'2025-08-22 14:42:20'),(45,16,'chance123','哈利波特：混血王子的背叛',1,399,'2025-08-22 14:42:20'),(46,16,'chance123','哈利波特：神秘的魔法石',2,198,'2025-08-22 14:42:20'),(47,16,'chance123','哈利波特：死神的聖物ⅠⅠ',2,998,'2025-08-22 14:42:20'),(48,16,'chance123','哈利波特：阿茲卡班的逃犯',1,299,'2025-08-22 14:42:20'),(49,16,'chance123','哈利波特：特別的愛給特別的你',1,699,'2025-08-22 14:42:20'),(50,17,'dan123','哈利波特：死神的聖物Ⅰ',3,1497,'2025-08-22 15:53:12'),(51,17,'dan123','哈利波特：火盃的考驗',2,598,'2025-08-22 15:53:12'),(52,17,'dan123','哈利波特：神秘的魔法石',1,99,'2025-08-22 15:53:12'),(53,17,'dan123','哈利波特：消失的密室',1,199,'2025-08-22 15:53:12'),(54,17,'dan123','哈利波特：鳳凰會的密令',2,598,'2025-08-22 15:53:12'),(55,17,'dan123','哈利波特：特別的愛給特別的你',2,1398,'2025-08-22 15:53:12'),(56,5,'chi123','哈利波特：鳳凰會的密令',3,897,'2025-08-22 16:04:03'),(57,5,'chi123','哈利波特：混血王子的背叛',2,798,'2025-08-22 16:04:03'),(58,5,'chi123','哈利波特：阿茲卡班的逃犯',2,598,'2025-08-22 16:04:03'),(59,5,'chi123','哈利波特：消失的密室',2,398,'2025-08-22 16:04:03'),(60,5,'chi123','哈利波特：火盃的考驗',3,897,'2025-08-22 16:04:03'),(61,5,'chi123','哈利波特：神秘的魔法石',4,396,'2025-08-22 16:04:03'),(62,5,'chi123','哈利波特：死神的聖物ⅠⅠ',2,1198,'2025-08-22 16:04:03'),(63,5,'chi123','哈利波特：死神的聖物Ⅰ',2,998,'2025-08-22 16:04:03'),(64,5,'chi123','哈利波特：特別的愛給特別的你',2,1398,'2025-08-22 16:04:03'),(65,5,'chi123','哈利波特：特別的愛給特別的你',1,699,'2025-08-23 19:45:39'),(66,5,'chi123','哈利波特：死神的聖物ⅠⅠ',1,599,'2025-08-23 19:45:39'),(67,18,'denis123','哈利波特：混血王子的背叛',2,798,'2025-08-23 19:47:11'),(68,18,'denis123','哈利波特：死神的聖物Ⅰ',1,499,'2025-08-23 19:47:11'),(69,18,'denis123','哈利波特：特別的愛給特別的你',1,699,'2025-08-23 19:47:11'),(70,18,'denis123','哈利波特：消失的密室',2,398,'2025-08-23 19:47:11'),(71,18,'denis123','哈利波特：死神的聖物ⅠⅠ',1,599,'2025-08-23 19:47:11'),(72,20,'earl123','哈利波特：死神的聖物ⅠⅠ',1,499,'2025-08-23 20:23:44'),(73,20,'earl123','哈利波特：死神的聖物Ⅰ',1,499,'2025-08-23 20:23:44'),(74,20,'earl123','哈利波特：特別的愛給特別的你',1,699,'2025-08-23 20:23:44'),(75,20,'earl123','哈利波特：混血王子的背叛',1,399,'2025-08-23 20:23:44'),(76,20,'earl123','哈利波特：阿茲卡班的逃犯',1,299,'2025-08-23 20:23:44'),(77,21,'eden123','怪獸與牠們的產地',1,299,'2025-08-23 22:00:21'),(78,21,'eden123','哈利波特：死神的聖物ⅠⅠ',1,499,'2025-08-23 22:00:21'),(79,21,'eden123','哈利波特：特別的愛給特別的你',2,1198,'2025-08-23 22:00:21'),(80,21,'eden123','哈利波特：死神的聖物Ⅰ',1,499,'2025-08-23 22:00:21'),(81,21,'eden123','哈利波特：神秘的魔法石',1,299,'2025-08-23 22:00:21'),(82,21,'eden123','哈利波特：混血王子的背叛',1,299,'2025-08-23 22:00:21'),(83,21,'eden123','哈利波特：鳳凰會的密令',2,598,'2025-08-23 22:00:21'),(84,21,'eden123','哈利波特：消失的密室',1,299,'2025-08-23 22:00:21'),(85,21,'eden123','哈利波特：阿茲卡班的逃犯',1,299,'2025-08-23 22:00:21'),(86,21,'eden123','哈利波特：火盃的考驗',1,299,'2025-08-23 22:00:21'),(87,5,'chi123','哈利波特：神秘的魔法石',1,299,'2025-08-23 22:53:27'),(88,5,'chi123','哈利波特：消失的密室',1,299,'2025-08-23 22:53:27'),(89,5,'chi123','哈利波特：死神的聖物Ⅰ',2,998,'2025-08-23 22:53:27'),(90,5,'chi123','怪獸與牠們的產地',2,598,'2025-08-23 22:53:27'),(91,22,'jacob123','哈利波特：消失的密室',1,299,'2025-08-24 08:59:30'),(92,22,'jacob123','哈利波特：死神的聖物Ⅰ',2,998,'2025-08-24 08:59:30'),(93,22,'jacob123','哈利波特：特別的愛給特別的你',2,1198,'2025-08-24 08:59:30'),(94,22,'jacob123','怪獸與牠們的產地',1,299,'2025-08-24 08:59:30');
/*!40000 ALTER TABLE `porder` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-08-24  9:03:17
